tap "cjbassi/gotop"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "linuxkit/linuxkit"
tap "rockyluke/devops"
tap "wagoodman/dive"
cask "adoptopenjdk"
# Search tool like grep, but optimized for programmers
brew "ack"
# GNU database manager
brew "gdbm"
# YAML Parser
brew "libyaml"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Automatic configure script builder
brew "autoconf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Benchmark suite for file systems and hard drives
brew "bonnie++"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Top-like interface for container metrics
brew "ctop"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line JSON processing tool
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Asynchronous event library
brew "libevent"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Java-based scripting language
brew "groovy", link: false
# SDK for Groovy: a Java-based scripting language
brew "groovysdk", link: false
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Improved top (interactive process viewer)
brew "htop"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Manage your Java environment
brew "jenv"
# GUI for vim, made for macOS
brew "macvim"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Modern programming language in the Lisp/Scheme family
brew "minimal-racket"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Manage compile and link flags for libraries
brew "pkg-config"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Password generator
brew "pwgen"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# x86 and PowerPC Emulator
brew "qemu"
# Autoformat shell script source code
brew "shfmt"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A terminal based graphical activity monitor inspired by gtop and vtop
brew "cjbassi/gotop/gotop"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Lightweight Linux distribution tool
brew "linuxkit/linuxkit/linuxkit"
# Clean up git branches.
brew "rockyluke/devops/pip-git-sweep"
# Linter for YAML files.
brew "rockyluke/devops/pip-gitlint"
# A tool for exploring each layer in a docker image
brew "wagoodman/dive/dive"
cask "adoptopenjdk8"
cask "appcleaner"
cask "bartender"
cask "beyond-compare"
cask "bitbar"
cask "caffeine"
cask "clipy"
cask "dash"
cask "docker"
cask "firefox"
cask "hex-fiend"
cask "iterm2"
cask "logitech-options"
cask "nvalt"
cask "onyx"
cask "paw"
cask "postman"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "racket"
cask "skitch"
cask "sourcetree"
cask "suspicious-package"
cask "vagrant"
cask "visual-studio-code"
cask "vmware-fusion"
mas "BetterSnapTool", id: 417375580
mas "com.satishmaha.Shinjuku", id: 953006734
mas "DaisyDisk", id: 411643860
mas "Deliveries", id: 924726344
mas "ForkLift", id: 412448059
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "iNet Network Scanner", id: 403304796
mas "Microsoft Remote Desktop", id: 1295203466
mas "Patterns", id: 429449079
mas "Simplenote", id: 692867256
mas "Slack", id: 803453959
mas "Smart JSON Editor", id: 1268962404
mas "SMARTReporter", id: 509148961
mas "TextLab", id: 1024903185
mas "The Unarchiver", id: 425424353
mas "VisualJSON", id: 488709442
